print("---------------------------创建一个空列表--------------------------------")
# 创建一个空列表
my_list = []
print("创建一个空列表:", my_list)
print()


print("----------------------------创建一个带有初始值的列表-----------------------------------")
# 创建一个带有初始值的列表
my_list = [1, 2, 3, 4, 5]
print(my_list[1:3])     # 输出：[2, 3]
print(my_list[:3])      # 输出：[1, 2, 3]
print(my_list[3:])      # 输出：[4, 5]
print(my_list[::3])     # [1, 3, 5]
print()


print("----------------------------向列表中添加元素---------------------------------------")
# 向列表中添加元素
my_list.append(6)
print("向列表中添加元素:", my_list)      # 输出：[1, 2, 3, 4, 5, 6]
print()

print("---------------------------列表中删除元素----------------------------------------")
# 使用del语句或remove()方法删除列表中的元素
del my_list[2]
print("列表中删除元素:", my_list)      # 输出：[1, 2, 4, 5, 6]
my_list.remove(1)
print("列表中删除元素:" + my_list)
print()


print("-----------------------------获取列表的长度---------------------------------")
# 获取列表的长度
print(len(my_list))
print()


print("----------------------------判断元素是否在列表中------------------------------------")
# 判断元素是否在列表中
print(3 in my_list) # 输出：False
print(5 in my_list) # 输出：True
print()
